// Здача №1
// Напишите программу, которая на выход принимает число и выдает его квадрат (число умноженное на само себя).
// Например:
// 4 -> 16
// -3 -> 9
// -7 -> 49

//1.Принимать число
//2.Посчитать квадрат
//3.Вывести число

//string b = Console.ReadLine();
//int a =Convert.ToInt32(b); // Convert.ToInt32(Console.ReadLine()) = Convert.ToInt32(b). 
//int result = a*a;
//Console.WriteLine(result);

// more short write:
//int a = Convert.ToInt32(Console.ReadLine());
// int result = a * a;
//Console.WriteLine(a * a);

//ИТЕРАЦИЯ №1. РАБОТА В ГРУППАХ


//Задача №3.
//Напишите программу, которая будет выдавать название дня недели по заданному номеру.

